000100180305PGM
000200180305   CALL STRJOB
000300180305   ADDLIBLE BCI433LIB
000301180326   ADDLIBLE   DMUB23
000400180312   ADDLIBLE SENECAPAY
000500180305   DSPSYSLVL *DISPLAY
000600180305   MONMSG CPF2103
000700180305ENDPGM
