000100180122PGM
000200180122     DSPLIBL
000300180122     EDTLIBL
000400180122     DSPLIBL
000500180122     DSPSYSVAL QSYSLIBL
000600180122     DSPSYSVAL QUSRLIBL
000700180122     DSPSYSVAL QMODEL
000800180122ENDPGM
