000100180205     FHWYTOLLDSPCF   E             WORKSTN
000101180205     F/FREE
000102180205            EXFMT TOLLINFO;
000103180205                  DOW NOT(*IN03);
000104180205                      EXSR SETTOLLRATE;
000105180205                      *IN99 =     *ON;
000106180205                      WRITE TOLLINFO;
000107180205                      EXFMT SHOWTOLL;
000108180205                      *IN99 =    *OFF;
000109180205                      IF *IN03 = *OFF;
000110180205                              EXSR CLEAR;
000111180205                              CLEAR TOLLINFO;
000112180205                              EXFMT TOLLINFO;
000113180205                      ENDIF;
000114180205                ENDDO;
000115180205            *INLR = *ON;
000116180205            RETURN;
000117180205            BEGSR SETTOLLRATE;
000118180205              TOLLRATE = .9999;
000119180205              TOLLCHARGE = 99;
000120180205              NOTRANSP = 9.99;
000121180205              TOTALDUE = 999.99;
000122180205            ENDSR;
000123180205
000124180205            BEGSR CLEAR;
000125180205              TOLLRATE = .0000;
000126180205              TOLLCHARGE = 00;
000127180205              NOTRANSP = 0.00;
000128180205              TOTALDUE = 000.00;
000129180205            ENDSR;
