000100180205     FHWYTOLLDSPCF   E             WORKSTN                                                          
000101180205     F/FREE                                                                                         
000102180205            EXFMT TOLLINFO;                                                                         
000103180205                  DOW NOT(*IN03);                                                                   
000104180205                      EXSR SETTOLLRATE;                                                             
000106180205                      *IN99 =     *ON;                                                              
000107180205                      WRITE TOLLINFO;                                                               
000108180205                      EXFMT SHOWTOLL;                                                               
000109180205                      *IN99 =    *OFF;                                                              
000110180205                      IF *IN03 = *OFF;                                                              
000111180205                              EXSR CLEAR;                                                           
000112180205                              CLEAR TOLLINFO;                                                       
000113180205                              EXFMT TOLLINFO;                                                       
000114180222                      ENDIF;                                                                        
000115180205                ENDDO;                                                                              
000116180205            *INLR = *ON;                                                                            
000117180205            RETURN;                                                                                 
000118180205            BEGSR SETTOLLRATE;                                                                      
000119180212                    EXSR ADJUSTTIME;                                                                
000121180212                    SELECT;                                                                         
000122180212                      WHEN HOUR>=19 OR HOUR <6;                                                     
000123180212                        SELECT;                                                                     
000124180212                          WHEN VEHICLE='L';                                                         
000125180212                            TOLLRATE=.2162;                                                         
000126180212                          WHEN VEHICLE='H';                                                         
000127180212                            TOLLRATE=.4324;                                                         
000128180212                          WHEN VEHICLE='M';                                                         
000129180212                            TOLLRATE=.6486;                                                         
000130180212                        ENDSL;                                                                      
000131180212                      WHEN HOUR < 8;                                                                
000132180212                         SELECT;                                                                    
000133180212                          WHEN VEHICLE='L';                                                         
000134180212                            TOLLRATE=.3707;                                                         
000135180212                          WHEN VEHICLE='H';                                                         
000136180212                            TOLLRATE=.7418;                                                         
000137180212                          WHEN VEHICLE='M';                                                         
000138180212                            TOLLRATE=1.1122;                                                        
000139180212                        ENDSL;                                                                      
000140180212                       WHEN HOUR < 10;                                                              
000141180212                         SELECT;                                                                    
000142180212                          WHEN VEHICLE='L';                                                         
000143180212                            TOLLRATE=.3259;                                                         
000144180212                          WHEN VEHICLE='H';                                                         
000145180212                            TOLLRATE=.6518;                                                         
000146180212                          WHEN VEHICLE='M';                                                         
000147180212                            TOLLRATE=.9778;                                                         
000148180212                        ENDSL;                                                                      
000149180212                       WHEN HOUR < 16;                                                              
000150180212                         SELECT;                                                                    
000151180212                          WHEN VEHICLE='L';                                                         
000152180212                            TOLLRATE=.2833;                                                         
000153180212                          WHEN VEHICLE='H';                                                         
000154180212                            TOLLRATE=.5666;                                                         
000155180212                          WHEN VEHICLE='M';                                                         
000156180212                            TOLLRATE=.8499;                                                         
000157180212                        ENDSL;                                                                      
000158180212                       WHEN HOUR < 19;                                                              
000159180212                         SELECT;                                                                    
000160180212                          WHEN VEHICLE='L';                                                         
000161180212                            TOLLRATE=.3842;                                                         
000162180212                          WHEN VEHICLE='H';                                                         
000163180212                            TOLLRATE=.7683;                                                         
000164180212                          WHEN VEHICLE='M';                                                         
000165180212                            TOLLRATE=1.1525;                                                        
000166180212                        ENDSL;                                                                      
000167180212                    ENDSL;                                                                          
000168180212                    TOLLCHARGE= KILOMETERS*TOLLRATE;                                                
000169180212                                                                                                    
000170180212                    IF TRANSPNDR = 'N';                                                             
000171180212                      NOTRANSP = 4.07;                                                              
000172180212                    ELSE;                                                                           
000173180212                      NOTRANSP = 0;                                                                 
000174180212                    ENDIF;                                                                          
000175180212                    TOTALDUE= TOLLCHARGE+NOTRANSP;                                                  
000176180205            ENDSR;                                                                                  
000177180212            BEGSR CLEAR;                                                                            
000178180212              KILOMETERS=0;                                                                         
000179180212              VEHICLE='';                                                                           
000180180212              AMPM='';                                                                              
000181180212              HOUR=0;                                                                               
000182180212              TRANSPNDR='';                                                                         
000183180212            ENDSR;                                                                                  
000184180212            BEGSR ADJUSTTIME;                                                                       
000185180212              IF AMPM='PM';                                                                         
000186180212                IF HOUR <> 12;                                                                      
000187180212                  HOUR = HOUR + 12;                                                                 
000188180212                  ELSE;                                                                             
000189180212                    HOUR=HOUR;                                                                      
000190180212                ENDIF;                                                                              
000191180212                ELSE;                                                                               
000192180212                  IF HOUR <> 12;                                                                    
000193180212                    HOUR=HOUR;                                                                      
000194180212                    ELSE;                                                                           
000195180212                      HOUR=0;                                                                       
000196180212                  ENDIF;                                                                            
000197180212              ENDIF;                                                                                
000198180212            ENDSR;                                                                                  
