000100180312     A          R RECORD1
000101180312     A                                  2  4USER
000102180312     A                                  2 28'Payroll Program Completed'
000103180312     A                                  2 66DATE EDTCDE(Y)
000104180312     A                                  3  4'MONARK PATEL'
000105180312     A                                  5 10'Rates:'
000106180312     A                                  7 19'Day Rate:'
000107180312     A            DAYRATE        5  2   7 37EDTCDE(1)
000108180312     A                                  8 19'Afternoon Rate:'
000109180312     A            AFTNRATE       5  2   8 37EDTCDE(1)
000110180312     A                                  9 19'Night Rate:'
000111180312     A            NIGHTRATE      5  2   9 37EDTCDE(1)
000112180312     A                                 11 11'Totals:'
000113180312     A                                 13 19'Regular Pay:'
000114180312     A            TOTREGPAY      9Y 2O 13 37EDTCDE(1)
000115180312     A                                 14 19'Overtime Pay:'
000116180312     A            TOTOVTPAY      9Y 2O 14 37EDTCDE(1)
000117180312     A                                 15 19'Company Payout:'
000118180312     A            TOTEMPPAY      9Y 2O 15 37EDTCDE(1)
000119180402     A                                  3 30' '
000120180403     A            WORKTYPE      25      4 27
