000100180404     A          R WORKWEEK                  PFILE(WORKWEEK2)
000102180403     A          K EMPNUM
000103180403     A          K WORKSHIFT
000104180403     A          K HRSWORKED
