000100180403     A          R WORKWEEK                  PFILE(SENECAPAY/WORKWEEK)
000101180403     A          K EMPNUM
000102180403     A          K WORKSHIFT
000103180403     A          K HRSWORKED
