000100180404     A          R WORKWEEK                  PFILE(WORKWEEK1)
000101180403     A          K EMPNUM
000102180403     A          K WORKSHIFT
000103180403     A          K HRSWORKED
